app/app/controllers/campings_controller.rb

  def index
    @campings = Camping.all
---
SELECT "campings".* FROM "campings"

  def create
    @camping = Camping.new(camping_params)

    respond_to do |format|
      if @camping.save
---
INSERT INTO "campings" ("name", "region", "city", "definition", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_camping
      @camping = Camping.find(params[:id])
---
SELECT "campings".* FROM "campings" WHERE "campings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]